//
//  PlusVoyageView.swift
//  DotPort2.0
//
//  Created by Illya Kovaliuk on 21.02.2026.
//

import SwiftUI

struct PlusVoyageView: View {
    var body: some View {
        Text("Hello, World!")
        // получається це вікно буде тільки для воркерів
        // для воркера буде функція створити вояж також при переході на будь який вояж буде рядом кнопка або старт або стоп вояжа, що логічно воркер може зупини вояж по якійсь причині наприклад поломка, в інших випадках вояж має зупинитись сам після прибуття по координати тобто якшо координати корабля дорівнюють координатам вояжа стопається вояж. Як тоді відслідковувати де вояж де корабель. Інший простіший варіант дати заготовляний час для вояжа наприклад з одеси до пекіна пливти 40 годин по виходу часу вояж стопається
        //
        //
        
    }
}

#Preview {
    PlusVoyageView()
}
